[Killed] BlockStatement
src/applyLineSelection.ts:11:40
 	const lines = content.split("\n");
 
 	// Handle parsed selector syntax
-	if (includeExampleTag.parsedSelector) {
-		const resolvedLines = resolveLineSelections(
-			includeExampleTag.parsedSelector,
-			lines.length,
-		);
-
-		return resolvedLines
-			.map((lineNumber: number) => {
-				const line = lines[lineNumber - 1];
-
-				if (line === undefined) {
-					throw new Error(
-						`Line number ${lineNumber} is out of range for file ${includeExampleTag.path}`,
-					);
-				}
-
-				return line;
-			})
-			.join("\n");
-	}
+	if (includeExampleTag.parsedSelector) {}
 
 	// No selector - use entire file
killedBy: It should apply single line selection
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3'

[Killed] ConditionalExpression
src/applyLineSelection.ts:11:6
 	const lines = content.split("\n");
 
 	// Handle parsed selector syntax
-	if (includeExampleTag.parsedSelector) {
+	if (false) {
 		const resolvedLines = resolveLineSelections(
 			includeExampleTag.parsedSelector,
killedBy: It should apply single line selection
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3'

[Killed] BlockStatement
src/applyLineSelection.ts:18:33
 		);
 
 		return resolvedLines
-			.map((lineNumber: number) => {
-				const line = lines[lineNumber - 1];
-
-				if (line === undefined) {
-					throw new Error(
-						`Line number ${lineNumber} is out of range for file ${includeExampleTag.path}`,
-					);
-				}
-
-				return line;
-			})
+			.map((lineNumber: number) => {})
 			.join("\n");
 	}
killedBy: It should apply single line selection
statusReason: expected '' to deeply equal 'line3'

[Killed] ArithmeticOperator
src/applyLineSelection.ts:19:24
 
 		return resolvedLines
 			.map((lineNumber: number) => {
-				const line = lines[lineNumber - 1];
+				const line = lines[lineNumber + 1];
 
 				if (line === undefined) {
killedBy: It should apply single line selection
statusReason: expected 'line5' to deeply equal 'line3'

[Killed] EqualityOperator
src/applyLineSelection.ts:21:9
 			.map((lineNumber: number) => {
 				const line = lines[lineNumber - 1];
 
-				if (line === undefined) {
+				if (line !== undefined) {
 					throw new Error(
 						`Line number ${lineNumber} is out of range for file ${includeExampleTag.path}`,
killedBy: It should apply single line selection
statusReason: Line number 3 is out of range for file test/file

[Killed] ConditionalExpression
src/applyLineSelection.ts:21:9
 			.map((lineNumber: number) => {
 				const line = lines[lineNumber - 1];
 
-				if (line === undefined) {
+				if (true) {
 					throw new Error(
 						`Line number ${lineNumber} is out of range for file ${includeExampleTag.path}`,
killedBy: It should apply single line selection
statusReason: Line number 3 is out of range for file test/file
