[NoCoverage] ConditionalExpression
src/findExample.ts:10:29
 
 export function findExample(comment: Comment): string | null {
 	const commentTag = comment.blockTags.find(
-		(tag: { tag: string }) => tag.tag === "@includeExample",
+		(tag: { tag: string }) => false,
 	);
 

[NoCoverage] ConditionalExpression
src/findExample.ts:10:29
 
 export function findExample(comment: Comment): string | null {
 	const commentTag = comment.blockTags.find(
-		(tag: { tag: string }) => tag.tag === "@includeExample",
+		(tag: { tag: string }) => true,
 	);
 

[NoCoverage] ConditionalExpression
src/findExample.ts:13:6
 		(tag: { tag: string }) => tag.tag === "@includeExample",
 	);
 
-	if (!commentTag) {
+	if (false) {
 		return null;
 	}

[NoCoverage] BlockStatement
src/findExample.ts:13:19
 		(tag: { tag: string }) => tag.tag === "@includeExample",
 	);
 
-	if (!commentTag) {
-		return null;
-	}
+	if (!commentTag) {}
 
 	const { dir, name, ext } = parse(comment.sourcePath || "");

[NoCoverage] ConditionalExpression
src/findExample.ts:17:35
 		return null;
 	}
 
-	const { dir, name, ext } = parse(comment.sourcePath || "");
+	const { dir, name, ext } = parse(false);
 	const exampleFileName = `${name}.example${ext}`;
 	const exampleFilePath = join(dir, exampleFileName);

[NoCoverage] ConditionalExpression
src/findExample.ts:17:35
 		return null;
 	}
 
-	const { dir, name, ext } = parse(comment.sourcePath || "");
+	const { dir, name, ext } = parse(true);
 	const exampleFileName = `${name}.example${ext}`;
 	const exampleFilePath = join(dir, exampleFileName);

[NoCoverage] StringLiteral
src/findExample.ts:18:26
 	}
 
 	const { dir, name, ext } = parse(comment.sourcePath || "");
-	const exampleFileName = `${name}.example${ext}`;
+	const exampleFileName = ``;
 	const exampleFilePath = join(dir, exampleFileName);
 

[NoCoverage] OptionalChaining
src/findExample.ts:22:3
 	const exampleFilePath = join(dir, exampleFileName);
 
 	const includeExampleTag: IncludeExampleTag = parseIncludeExampleTag(
-		commentTag.content[0]?.text || "",
+		commentTag.content[0].text || "",
 		exampleFilePath,
 	);

[NoCoverage] ConditionalExpression
src/findExample.ts:22:3
 	const exampleFilePath = join(dir, exampleFileName);
 
 	const includeExampleTag: IncludeExampleTag = parseIncludeExampleTag(
-		commentTag.content[0]?.text || "",
+		false,
 		exampleFilePath,
 	);

[NoCoverage] BooleanLiteral
src/findExample.ts:26:6
 		exampleFilePath,
 	);
 
-	if (!existsSync(includeExampleTag.path)) {
+	if (existsSync(includeExampleTag.path)) {
 		// Try resolving relative to source file directory
 		const relativePath = join(dir, includeExampleTag.path);

[NoCoverage] ConditionalExpression
src/findExample.ts:26:6
 		exampleFilePath,
 	);
 
-	if (!existsSync(includeExampleTag.path)) {
+	if (false) {
 		// Try resolving relative to source file directory
 		const relativePath = join(dir, includeExampleTag.path);

[NoCoverage] ConditionalExpression
src/findExample.ts:29:7
 	if (!existsSync(includeExampleTag.path)) {
 		// Try resolving relative to source file directory
 		const relativePath = join(dir, includeExampleTag.path);
-		if (existsSync(relativePath)) {
+		if (true) {
 			includeExampleTag.path = relativePath;
 		}

[NoCoverage] BlockStatement
src/findExample.ts:29:33
 	if (!existsSync(includeExampleTag.path)) {
 		// Try resolving relative to source file directory
 		const relativePath = join(dir, includeExampleTag.path);
-		if (existsSync(relativePath)) {
-			includeExampleTag.path = relativePath;
-		}
+		if (existsSync(relativePath)) {}
 	}
 

[NoCoverage] StringLiteral
src/findExample.ts:38:59
 		throw new Error(`File not found for ${includeExampleTag.path}`);
 	}
 
-	const fileContent = readFileSync(includeExampleTag.path, "utf-8");
+	const fileContent = readFileSync(includeExampleTag.path, "");
 	return applyLineSelection(fileContent, includeExampleTag);
 }
