[NoCoverage] BlockStatement
src/includeExample.ts:3:73
 import type { Comment } from "typedoc";
 
-export function includeExample(comment: Comment, example: string): void {
-	comment.summary.push({
-		kind: "code",
-		text: `\n\n### Example\n\`\`\`\n${example}\n\`\`\``,
-	});
-
-	comment.blockTags = comment.blockTags.filter(
-		(tag) => tag.tag !== "@includeExample",
-	);
-}
+export function includeExample(comment: Comment, example: string): void {}
 

[NoCoverage] StringLiteral
src/includeExample.ts:5:9
 
 export function includeExample(comment: Comment, example: string): void {
 	comment.summary.push({
-		kind: "code",
+		kind: "",
 		text: `\n\n### Example\n\`\`\`\n${example}\n\`\`\``,
 	});

[NoCoverage] MethodExpression
src/includeExample.ts:9:22
 		text: `\n\n### Example\n\`\`\`\n${example}\n\`\`\``,
 	});
 
-	comment.blockTags = comment.blockTags.filter(
-		(tag) => tag.tag !== "@includeExample",
-	);
+	comment.blockTags = comment.blockTags;
 }
 

[NoCoverage] ArrowFunction
src/includeExample.ts:10:3
 	});
 
 	comment.blockTags = comment.blockTags.filter(
-		(tag) => tag.tag !== "@includeExample",
+		() => undefined,
 	);
 }

[NoCoverage] EqualityOperator
src/includeExample.ts:10:12
 	});
 
 	comment.blockTags = comment.blockTags.filter(
-		(tag) => tag.tag !== "@includeExample",
+		(tag) => tag.tag === "@includeExample",
 	);
 }
