[NoCoverage] BlockStatement
src/iterateProjectComments.ts:3:78
 import type { Comment, Context, Reflection } from "typedoc";
 
-export function* iterateProjectComments(context: Context): Iterable<Comment> {
-	for (const key in context.project.reflections) {
-		const reflection: Reflection = context.project.reflections[key];
-		const comment: Comment | undefined = reflection.comment;
-
-		if (comment) {
-			yield comment;
-		}
-	}
-}
+export function* iterateProjectComments(context: Context): Iterable<Comment> {}
 

[NoCoverage] BlockStatement
src/iterateProjectComments.ts:4:49
 import type { Comment, Context, Reflection } from "typedoc";
 
 export function* iterateProjectComments(context: Context): Iterable<Comment> {
-	for (const key in context.project.reflections) {
-		const reflection: Reflection = context.project.reflections[key];
-		const comment: Comment | undefined = reflection.comment;
-
-		if (comment) {
-			yield comment;
-		}
-	}
+	for (const key in context.project.reflections) {}
 }
 

[NoCoverage] ConditionalExpression
src/iterateProjectComments.ts:8:7
 		const reflection: Reflection = context.project.reflections[key];
 		const comment: Comment | undefined = reflection.comment;
 
-		if (comment) {
+		if (true) {
 			yield comment;
 		}

[NoCoverage] ConditionalExpression
src/iterateProjectComments.ts:8:7
 		const reflection: Reflection = context.project.reflections[key];
 		const comment: Comment | undefined = reflection.comment;
 
-		if (comment) {
+		if (false) {
 			yield comment;
 		}
