[NoCoverage] BlockStatement
src/load.ts:5:52
 import { Application, Converter } from "typedoc";
 import { processComments } from "./processComments.js";
 
-export function load(application: ApplicationType) {
-	application.on(Application.EVENT_BOOTSTRAP_END, () => {
-		application.options.setValue("blockTags", [
-			...new Set([
-				...application.options.getValue("blockTags"),
-				"@includeExample",
-			]),
-		]);
-	});
-
-	application.converter.on(Converter.EVENT_RESOLVE_BEGIN, processComments);
-}
+export function load(application: ApplicationType) {}
 

[NoCoverage] BlockStatement
src/load.ts:6:56
 import { processComments } from "./processComments.js";
 
 export function load(application: ApplicationType) {
-	application.on(Application.EVENT_BOOTSTRAP_END, () => {
-		application.options.setValue("blockTags", [
-			...new Set([
-				...application.options.getValue("blockTags"),
-				"@includeExample",
-			]),
-		]);
-	});
+	application.on(Application.EVENT_BOOTSTRAP_END, () => {});
 
 	application.converter.on(Converter.EVENT_RESOLVE_BEGIN, processComments);

[NoCoverage] ArrayDeclaration
src/load.ts:8:15
 export function load(application: ApplicationType) {
 	application.on(Application.EVENT_BOOTSTRAP_END, () => {
 		application.options.setValue("blockTags", [
-			...new Set([
-				...application.options.getValue("blockTags"),
-				"@includeExample",
-			]),
+			...new Set([]),
 		]);
 	});
