[Killed] ConditionalExpression
src/parseIncludeExampleTag.ts:9:6
 	filePath?: string,
 ): IncludeExampleTag {
 	// Handle empty tag
-	if (!tag && !filePath) {
+	if (true) {
 		return { path: "" };
 	}
killedBy: it should parse tag with file path only
statusReason: expected '' to be 'path/to/file' // Object.is equality

[Killed] LogicalOperator
src/parseIncludeExampleTag.ts:9:6
 	filePath?: string,
 ): IncludeExampleTag {
 	// Handle empty tag
-	if (!tag && !filePath) {
+	if (!tag || !filePath) {
 		return { path: "" };
 	}
killedBy: it should parse tag with file path only
statusReason: expected '' to be 'path/to/file' // Object.is equality

[Survived] Regex
src/parseIncludeExampleTag.ts:14:33
 	}
 
 	// Check for new bracket syntax: path/to/file[selector] or path/to/file[]
-	const bracketMatch = tag.match(/^(.+?)\[(.*)?\]$/);
+	const bracketMatch = tag.match(/^(.+?)\[(.*)?\]/);
 
 	if (bracketMatch) {

[Killed] BlockStatement
src/parseIncludeExampleTag.ts:16:20
 	// Check for new bracket syntax: path/to/file[selector] or path/to/file[]
 	const bracketMatch = tag.match(/^(.+?)\[(.*)?\]$/);
 
-	if (bracketMatch) {
-		// New bracket syntax
-		const [, path, selectorString] = bracketMatch;
-
-		// Check for empty brackets
-		if (selectorString === "" || selectorString === undefined) {
-			throw new Error("Empty bracket syntax");
-		}
-
-		const includeExampleTag: IncludeExampleTag = { path };
-
-		// Parse the selector string using new bracket syntax
-		const parsed = parseLineSelector(selectorString);
-
-		// Store the parsed selector for later resolution
-		includeExampleTag.parsedSelector = parsed;
-
-		return includeExampleTag;
-	}
+	if (bracketMatch) {}
 
 	// If tag contains brackets but doesn't match valid bracket syntax, it's malformed
killedBy: it should parse tag with file path and single line
statusReason: Malformed bracket syntax

[Killed] ConditionalExpression
src/parseIncludeExampleTag.ts:16:6
 	// Check for new bracket syntax: path/to/file[selector] or path/to/file[]
 	const bracketMatch = tag.match(/^(.+?)\[(.*)?\]$/);
 
-	if (bracketMatch) {
+	if (true) {
 		// New bracket syntax
 		const [, path, selectorString] = bracketMatch;
killedBy: it should parse tag with file path only
statusReason: bracketMatch is not iterable

[Killed] LogicalOperator
src/parseIncludeExampleTag.ts:21:7
 		const [, path, selectorString] = bracketMatch;
 
 		// Check for empty brackets
-		if (selectorString === "" || selectorString === undefined) {
+		if (selectorString === "" && selectorString === undefined) {
 			throw new Error("Empty bracket syntax");
 		}
killedBy: it should throw error on empty brackets
statusReason: expected [Function] to throw error including 'Empty bracket syntax' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/parseIncludeExampleTag.ts:21:7
 		const [, path, selectorString] = bracketMatch;
 
 		// Check for empty brackets
-		if (selectorString === "" || selectorString === undefined) {
+		if (selectorString !== "" || selectorString === undefined) {
 			throw new Error("Empty bracket syntax");
 		}
killedBy: it should parse tag with file path and single line
statusReason: Empty bracket syntax

[Killed] StringLiteral
src/parseIncludeExampleTag.ts:22:20
 
 		// Check for empty brackets
 		if (selectorString === "" || selectorString === undefined) {
-			throw new Error("Empty bracket syntax");
+			throw new Error("");
 		}
 
killedBy: it should throw error on empty brackets
statusReason: expected [Function] to throw error including 'Empty bracket syntax' but got ''

[Killed] ConditionalExpression
src/parseIncludeExampleTag.ts:37:6
 	}
 
 	// If tag contains brackets but doesn't match valid bracket syntax, it's malformed
-	if (tag.includes("[") || tag.includes("]")) {
+	if (true) {
 		throw new Error("Malformed bracket syntax");
 	}
killedBy: it should parse tag with file path only
statusReason: Malformed bracket syntax

[Killed] BlockStatement
src/parseIncludeExampleTag.ts:37:46
 	}
 
 	// If tag contains brackets but doesn't match valid bracket syntax, it's malformed
-	if (tag.includes("[") || tag.includes("]")) {
-		throw new Error("Malformed bracket syntax");
-	}
+	if (tag.includes("[") || tag.includes("]")) {}
 
 	// Check for old colon syntax: path/to/file:selector
killedBy: it should throw error on malformed brackets
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
src/parseIncludeExampleTag.ts:44:6
 	// Check for old colon syntax: path/to/file:selector
 	// Only treat as selector if it looks like line numbers/ranges
 	const colonIndex = tag.lastIndexOf(":");
-	if (colonIndex !== -1) {
+	if (true) {
 		const potentialPath = tag.substring(0, colonIndex);
 		const potentialSelector = tag.substring(colonIndex + 1);

[NoCoverage] BlockStatement
src/parseIncludeExampleTag.ts:44:25
 	// Check for old colon syntax: path/to/file:selector
 	// Only treat as selector if it looks like line numbers/ranges
 	const colonIndex = tag.lastIndexOf(":");
-	if (colonIndex !== -1) {
-		const potentialPath = tag.substring(0, colonIndex);
-		const potentialSelector = tag.substring(colonIndex + 1);
-
-		// Check if the part after colon looks like a line selector
-		if (potentialSelector.trim() && /^[\d\-,\s]+$/.test(potentialSelector)) {
-			// This looks like old colon syntax with line selectors
-			throw new Error(
-				`BREAKING CHANGE: The colon syntax '${tag}' is no longer supported in v3.0.0+. Please migrate to the new bracket syntax: '${potentialPath}[${potentialSelector.replace(
-					/-/g,
-					":",
-				)}]'. See documentation for the new bracket syntax.`,
-			);
-		}
-	}
+	if (colonIndex !== -1) {}
 
 	// No selector syntax - use entire file

[NoCoverage] MethodExpression
src/parseIncludeExampleTag.ts:45:25
 	// Only treat as selector if it looks like line numbers/ranges
 	const colonIndex = tag.lastIndexOf(":");
 	if (colonIndex !== -1) {
-		const potentialPath = tag.substring(0, colonIndex);
+		const potentialPath = tag;
 		const potentialSelector = tag.substring(colonIndex + 1);
 

[NoCoverage] MethodExpression
src/parseIncludeExampleTag.ts:46:29
 	const colonIndex = tag.lastIndexOf(":");
 	if (colonIndex !== -1) {
 		const potentialPath = tag.substring(0, colonIndex);
-		const potentialSelector = tag.substring(colonIndex + 1);
+		const potentialSelector = tag;
 
 		// Check if the part after colon looks like a line selector

[NoCoverage] ArithmeticOperator
src/parseIncludeExampleTag.ts:46:43
 	const colonIndex = tag.lastIndexOf(":");
 	if (colonIndex !== -1) {
 		const potentialPath = tag.substring(0, colonIndex);
-		const potentialSelector = tag.substring(colonIndex + 1);
+		const potentialSelector = tag.substring(colonIndex - 1);
 
 		// Check if the part after colon looks like a line selector

[NoCoverage] LogicalOperator
src/parseIncludeExampleTag.ts:49:7
 		const potentialSelector = tag.substring(colonIndex + 1);
 
 		// Check if the part after colon looks like a line selector
-		if (potentialSelector.trim() && /^[\d\-,\s]+$/.test(potentialSelector)) {
+		if (potentialSelector.trim() || /^[\d\-,\s]+$/.test(potentialSelector)) {
 			// This looks like old colon syntax with line selectors
 			throw new Error(

[NoCoverage] ConditionalExpression
src/parseIncludeExampleTag.ts:49:7
 		const potentialSelector = tag.substring(colonIndex + 1);
 
 		// Check if the part after colon looks like a line selector
-		if (potentialSelector.trim() && /^[\d\-,\s]+$/.test(potentialSelector)) {
+		if (false) {
 			// This looks like old colon syntax with line selectors
 			throw new Error(

[Killed] ConditionalExpression
src/parseIncludeExampleTag.ts:61:35
 	}
 
 	// No selector syntax - use entire file
-	const path: string | undefined = tag || filePath;
+	const path: string | undefined = false;
 
 	if (!path) {
killedBy: it should parse tag with file path only
statusReason: expected '' to be 'path/to/file' // Object.is equality

[Killed] LogicalOperator
src/parseIncludeExampleTag.ts:61:35
 	}
 
 	// No selector syntax - use entire file
-	const path: string | undefined = tag || filePath;
+	const path: string | undefined = tag && filePath;
 
 	if (!path) {
killedBy: it should parse tag with file path only
statusReason: expected '' to be 'path/to/file' // Object.is equality
