[NoCoverage] BlockStatement
src/processComments.ts:6:51
 import { includeExample } from "./includeExample.js";
 import { iterateProjectComments } from "./iterateProjectComments.js";
 
-export function processComments(context: Context) {
-	for (const comment of iterateProjectComments(context)) {
-		const example = findExample(comment);
-
-		if (example !== null) {
-			includeExample(comment, example);
-		}
-	}
-}
+export function processComments(context: Context) {}
 

[NoCoverage] BlockStatement
src/processComments.ts:7:57
 import { iterateProjectComments } from "./iterateProjectComments.js";
 
 export function processComments(context: Context) {
-	for (const comment of iterateProjectComments(context)) {
-		const example = findExample(comment);
-
-		if (example !== null) {
-			includeExample(comment, example);
-		}
-	}
+	for (const comment of iterateProjectComments(context)) {}
 }
 

[NoCoverage] ConditionalExpression
src/processComments.ts:10:7
 	for (const comment of iterateProjectComments(context)) {
 		const example = findExample(comment);
 
-		if (example !== null) {
+		if (false) {
 			includeExample(comment, example);
 		}

[NoCoverage] BlockStatement
src/processComments.ts:10:25
 	for (const comment of iterateProjectComments(context)) {
 		const example = findExample(comment);
 
-		if (example !== null) {
-			includeExample(comment, example);
-		}
+		if (example !== null) {}
 	}
 }
