[Killed] EqualityOperator
src/resolveLineSelections.ts:8:6
 	parsed: ParsedLineSelector,
 	totalLines: number,
 ): number[] {
-	if (totalLines <= 0) {
+	if (totalLines > 0) {
 		return [];
 	}
killedBy: Should resolve basic range
statusReason: expected [] to deeply equal [ 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/resolveLineSelections.ts:8:6
 	parsed: ParsedLineSelector,
 	totalLines: number,
 ): number[] {
-	if (totalLines <= 0) {
+	if (true) {
 		return [];
 	}
killedBy: It should apply single line selection
statusReason: expected '' to deeply equal 'line3'

[Killed] BlockStatement
src/resolveLineSelections.ts:16:45
 	const excludedLines = new Set<number>();
 
 	// Process all selections
-	for (const selection of parsed.selections) {
-		const lines = resolveSelection(selection, totalLines);
-		const targetSet = selection.isExclusion ? excludedLines : includedLines;
-		for (const line of lines) {
-			targetSet.add(line);
-		}
-	}
+	for (const selection of parsed.selections) {}
 
 	// If no inclusions specified, include all lines
killedBy: It should apply single line selection
statusReason: expected '' to deeply equal 'line3'

[Killed] BlockStatement
src/resolveLineSelections.ts:19:29
 	for (const selection of parsed.selections) {
 		const lines = resolveSelection(selection, totalLines);
 		const targetSet = selection.isExclusion ? excludedLines : includedLines;
-		for (const line of lines) {
-			targetSet.add(line);
-		}
+		for (const line of lines) {}
 	}
 
killedBy: Should resolve basic range
statusReason: expected [] to deeply equal [ 2, 3, 4, 5 ]

[Killed] BlockStatement
src/resolveLineSelections.ts:25:37
 	}
 
 	// If no inclusions specified, include all lines
-	if (shouldIncludeAllLines(parsed)) {
-		for (let i = 1; i <= totalLines; i++) {
-			includedLines.add(i);
-		}
-	}
+	if (shouldIncludeAllLines(parsed)) {}
 
 	// Apply exclusions
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected '' to deeply equal 'line1\nline5'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:25:6
 	}
 
 	// If no inclusions specified, include all lines
-	if (shouldIncludeAllLines(parsed)) {
+	if (true) {
 		for (let i = 1; i <= totalLines; i++) {
 			includedLines.add(i);
killedBy: It should apply single line selection
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3'

[Killed] EqualityOperator
src/resolveLineSelections.ts:26:19
 
 	// If no inclusions specified, include all lines
 	if (shouldIncludeAllLines(parsed)) {
-		for (let i = 1; i <= totalLines; i++) {
+		for (let i = 1; i < totalLines; i++) {
 			includedLines.add(i);
 		}
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected 'line1' to deeply equal 'line1\nline5'

[Killed] EqualityOperator
src/resolveLineSelections.ts:26:19
 
 	// If no inclusions specified, include all lines
 	if (shouldIncludeAllLines(parsed)) {
-		for (let i = 1; i <= totalLines; i++) {
+		for (let i = 1; i > totalLines; i++) {
 			includedLines.add(i);
 		}
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected '' to deeply equal 'line1\nline5'

[Killed] BlockStatement
src/resolveLineSelections.ts:32:36
 	}
 
 	// Apply exclusions
-	for (const line of excludedLines) {
-		includedLines.delete(line);
-	}
+	for (const line of excludedLines) {}
 
 	// Return sorted array
killedBy: It should apply single line exclusions
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line1\nline2\nline4\nline5'

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:37:50
 	}
 
 	// Return sorted array
-	return Array.from(includedLines).sort((a, b) => a - b);
+	return Array.from(includedLines).sort((a, b) => a + b);
 }
 
killedBy: It should handle complex mixed positive and negative selections
statusReason: expected 'line1\nline3\nline8\nline10\nline5\nl…' to deeply equal 'line1\nline3\nline5\nline6\nline7\nli…'

[Killed] MethodExpression
src/resolveLineSelections.ts:37:9
 	}
 
 	// Return sorted array
-	return Array.from(includedLines).sort((a, b) => a - b);
+	return Array.from(includedLines);
 }
 
killedBy: It should handle complex mixed positive and negative selections
statusReason: expected 'line1\nline3\nline8\nline10\nline5\nl…' to deeply equal 'line1\nline3\nline5\nline6\nline7\nli…'

[Killed] BlockStatement
src/resolveLineSelections.ts:43:13
 function resolveSelection(
 	selection: LineSelection,
 	totalLines: number,
-): number[] {
-	switch (selection.type) {
-		case "single":
-			return resolveLine(selection, totalLines);
-		case "range":
-			return resolveRange(selection, totalLines);
-	}
-}
+): number[] {}
 
 function resolveLine(
killedBy: It should apply single line selection
statusReason: lines is not iterable

[Killed] ConditionalExpression
src/resolveLineSelections.ts:45:3
 	totalLines: number,
 ): number[] {
 	switch (selection.type) {
-		case "single":
-			return resolveLine(selection, totalLines);
+		case "single":
 		case "range":
 			return resolveRange(selection, totalLines);
killedBy: It should apply single line selection
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:47:3
 	switch (selection.type) {
 		case "single":
 			return resolveLine(selection, totalLines);
-		case "range":
-			return resolveRange(selection, totalLines);
+		case "range":
 	}
 }
killedBy: It should apply range selection
statusReason: lines is not iterable

[Killed] StringLiteral
src/resolveLineSelections.ts:47:8
 	switch (selection.type) {
 		case "single":
 			return resolveLine(selection, totalLines);
-		case "range":
+		case "":
 			return resolveRange(selection, totalLines);
 	}
killedBy: It should apply range selection
statusReason: lines is not iterable

[Killed] BlockStatement
src/resolveLineSelections.ts:55:13
 function resolveLine(
 	selection: LineSelection & { type: "single" },
 	totalLines: number,
-): number[] {
-	const line =
-		selection.line < 0
-			? totalLines + selection.line + 1 // Convert negative index to positive index
-			: selection.line;
-
-	if (line < 1 || line > totalLines) {
-		throw new Error(
-			`Line ${selection.line} is out of range (file has ${totalLines} lines)`,
-		);
-	}
-
-	return [line];
-}
+): number[] {}
 
 function resolveRange(
killedBy: It should apply single line selection
statusReason: lines is not iterable

[Killed] ConditionalExpression
src/resolveLineSelections.ts:57:3
 	totalLines: number,
 ): number[] {
 	const line =
-		selection.line < 0
+		true
 			? totalLines + selection.line + 1 // Convert negative index to positive index
 			: selection.line;
killedBy: It should apply single line selection
statusReason: Line 3 is out of range (file has 5 lines)

[Killed] EqualityOperator
src/resolveLineSelections.ts:57:3
 	totalLines: number,
 ): number[] {
 	const line =
-		selection.line < 0
+		selection.line >= 0
 			? totalLines + selection.line + 1 // Convert negative index to positive index
 			: selection.line;
killedBy: It should apply single line selection
statusReason: Line 3 is out of range (file has 5 lines)

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:58:6
 ): number[] {
 	const line =
 		selection.line < 0
-			? totalLines + selection.line + 1 // Convert negative index to positive index
+			? totalLines - selection.line + 1 // Convert negative index to positive index
 			: selection.line;
 
killedBy: It should apply negative single line selection
statusReason: Line -2 is out of range (file has 5 lines)

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:58:6
 ): number[] {
 	const line =
 		selection.line < 0
-			? totalLines + selection.line + 1 // Convert negative index to positive index
+			? totalLines + selection.line - 1 // Convert negative index to positive index // Convert negative index to positive index
 			: selection.line;
 
killedBy: It should apply negative single line selection
statusReason: expected 'line2' to deeply equal 'line4'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:61:6
 			? totalLines + selection.line + 1 // Convert negative index to positive index
 			: selection.line;
 
-	if (line < 1 || line > totalLines) {
+	if (true) {
 		throw new Error(
 			`Line ${selection.line} is out of range (file has ${totalLines} lines)`,
killedBy: It should apply single line selection
statusReason: Line 3 is out of range (file has 5 lines)

[Killed] EqualityOperator
src/resolveLineSelections.ts:61:18
 			? totalLines + selection.line + 1 // Convert negative index to positive index
 			: selection.line;
 
-	if (line < 1 || line > totalLines) {
+	if (line < 1 || line <= totalLines) {
 		throw new Error(
 			`Line ${selection.line} is out of range (file has ${totalLines} lines)`,
killedBy: It should apply single line selection
statusReason: Line 3 is out of range (file has 5 lines)

[Killed] ConditionalExpression
src/resolveLineSelections.ts:78:6
 	let end = selection.end;
 
 	// Convert negative index to positive index
-	if (start !== undefined && start < 0) {
+	if (false) {
 		start = totalLines + start + 1;
 	}
killedBy: It should apply negative range
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3\nline4\nline5'

[Killed] EqualityOperator
src/resolveLineSelections.ts:78:6
 	let end = selection.end;
 
 	// Convert negative index to positive index
-	if (start !== undefined && start < 0) {
+	if (start === undefined && start < 0) {
 		start = totalLines + start + 1;
 	}
killedBy: It should apply negative range
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3\nline4\nline5'

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:79:11
 
 	// Convert negative index to positive index
 	if (start !== undefined && start < 0) {
-		start = totalLines + start + 1;
+		start = totalLines - start + 1;
 	}
 	if (end !== undefined && end < 0) {
killedBy: It should apply negative range
statusReason: expected 'line5' to deeply equal 'line3\nline4\nline5'

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:79:11
 
 	// Convert negative index to positive index
 	if (start !== undefined && start < 0) {
-		start = totalLines + start + 1;
+		start = totalLines + start - 1;
 	}
 	if (end !== undefined && end < 0) {
killedBy: It should apply negative range
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3\nline4\nline5'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:81:6
 	if (start !== undefined && start < 0) {
 		start = totalLines + start + 1;
 	}
-	if (end !== undefined && end < 0) {
+	if (true) {
 		end = totalLines + end + 1;
 	}
killedBy: It should apply range selection
statusReason: expected 'line2\nline3\nline4\nline5' to deeply equal 'line2\nline3\nline4'

[Killed] BlockStatement
src/resolveLineSelections.ts:81:36
 	if (start !== undefined && start < 0) {
 		start = totalLines + start + 1;
 	}
-	if (end !== undefined && end < 0) {
-		end = totalLines + end + 1;
-	}
+	if (end !== undefined && end < 0) {}
 
 	// Default to full range if not specified
killedBy: It should apply negative range
statusReason: expected '' to deeply equal 'line3\nline4\nline5'

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:82:9
 		start = totalLines + start + 1;
 	}
 	if (end !== undefined && end < 0) {
-		end = totalLines + end + 1;
+		end = totalLines - end + 1;
 	}
 
killedBy: It should apply open-ended range to negative end
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line1\nline2\nline3\nline4'

[Killed] ArithmeticOperator
src/resolveLineSelections.ts:82:9
 		start = totalLines + start + 1;
 	}
 	if (end !== undefined && end < 0) {
-		end = totalLines + end + 1;
+		end = totalLines + end - 1;
 	}
 
killedBy: It should apply negative range
statusReason: expected 'line3' to deeply equal 'line3\nline4\nline5'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:86:6
 	}
 
 	// Default to full range if not specified
-	if (start === undefined) start = 1;
+	if (false) start = 1;
 	if (end === undefined) end = totalLines;
 
killedBy: It should apply open-ended range to end
statusReason: expected '' to deeply equal 'line1\nline2\nline3'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:86:6
 	}
 
 	// Default to full range if not specified
-	if (start === undefined) start = 1;
+	if (true) start = 1;
 	if (end === undefined) end = totalLines;
 
killedBy: It should apply range selection
statusReason: expected 'line1\nline2\nline3\nline4' to deeply equal 'line2\nline3\nline4'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:87:6
 
 	// Default to full range if not specified
 	if (start === undefined) start = 1;
-	if (end === undefined) end = totalLines;
+	if (false) end = totalLines;
 
 	// Validate bounds - be more lenient for empty files
killedBy: It should apply open-ended range from start
statusReason: expected '' to deeply equal 'line3\nline4\nline5'

[Killed] EqualityOperator
src/resolveLineSelections.ts:87:6
 
 	// Default to full range if not specified
 	if (start === undefined) start = 1;
-	if (end === undefined) end = totalLines;
+	if (end !== undefined) end = totalLines;
 
 	// Validate bounds - be more lenient for empty files
killedBy: It should apply range selection
statusReason: expected 'line2\nline3\nline4\nline5' to deeply equal 'line2\nline3\nline4'

[Killed] EqualityOperator
src/resolveLineSelections.ts:90:6
 	if (end === undefined) end = totalLines;
 
 	// Validate bounds - be more lenient for empty files
-	if (totalLines === 0) {
+	if (totalLines !== 0) {
 		return [];
 	}
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:90:6
 	if (end === undefined) end = totalLines;
 
 	// Validate bounds - be more lenient for empty files
-	if (totalLines === 0) {
+	if (true) {
 		return [];
 	}
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] MethodExpression
src/resolveLineSelections.ts:95:22
 	}
 
 	// Clamp to valid range
-	start = Math.max(1, Math.min(start, totalLines));
+	start = Math.max(1, Math.max(start, totalLines));
 	end = Math.max(1, Math.min(end, totalLines));
 
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] MethodExpression
src/resolveLineSelections.ts:95:10
 	}
 
 	// Clamp to valid range
-	start = Math.max(1, Math.min(start, totalLines));
+	start = Math.min(1, Math.min(start, totalLines));
 	end = Math.max(1, Math.min(end, totalLines));
 
killedBy: It should apply range selection
statusReason: expected 'line1\nline2\nline3\nline4' to deeply equal 'line2\nline3\nline4'

[Killed] MethodExpression
src/resolveLineSelections.ts:96:8
 
 	// Clamp to valid range
 	start = Math.max(1, Math.min(start, totalLines));
-	end = Math.max(1, Math.min(end, totalLines));
+	end = Math.min(1, Math.min(end, totalLines));
 
 	if (start > end) {
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] MethodExpression
src/resolveLineSelections.ts:96:20
 
 	// Clamp to valid range
 	start = Math.max(1, Math.min(start, totalLines));
-	end = Math.max(1, Math.min(end, totalLines));
+	end = Math.max(1, Math.max(end, totalLines));
 
 	if (start > end) {
killedBy: It should apply range selection
statusReason: expected 'line2\nline3\nline4\nline5' to deeply equal 'line2\nline3\nline4'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:98:6
 	start = Math.max(1, Math.min(start, totalLines));
 	end = Math.max(1, Math.min(end, totalLines));
 
-	if (start > end) {
+	if (true) {
 		return [];
 	}
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] EqualityOperator
src/resolveLineSelections.ts:98:6
 	start = Math.max(1, Math.min(start, totalLines));
 	end = Math.max(1, Math.min(end, totalLines));
 
-	if (start > end) {
+	if (start <= end) {
 		return [];
 	}
killedBy: It should apply range selection
statusReason: expected '' to deeply equal 'line2\nline3\nline4'

[Killed] ArrayDeclaration
src/resolveLineSelections.ts:99:10
 	end = Math.max(1, Math.min(end, totalLines));
 
 	if (start > end) {
-		return [];
+		return ["Stryker was here"];
 	}
 
killedBy: It should handle mixed range with reverse order
statusReason: Line number Stryker was here is out of range for file test/file

[Killed] ArrayDeclaration
src/resolveLineSelections.ts:102:27
 		return [];
 	}
 
-	const result: number[] = [];
+	const result: number[] = ["Stryker was here"];
 	for (let i = start; i <= end; i++) {
 		result.push(i);
killedBy: It should apply range selection
statusReason: Line number Stryker was here is out of range for file test/file

[Killed] EqualityOperator
src/resolveLineSelections.ts:103:22
 	}
 
 	const result: number[] = [];
-	for (let i = start; i <= end; i++) {
+	for (let i = start; i < end; i++) {
 		result.push(i);
 	}
killedBy: It should apply range selection
statusReason: expected 'line2\nline3' to deeply equal 'line2\nline3\nline4'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:103:22
 	}
 
 	const result: number[] = [];
-	for (let i = start; i <= end; i++) {
+	for (let i = start; false; i++) {
 		result.push(i);
 	}
killedBy: Should resolve basic range
statusReason: expected [] to deeply equal [ 2, 3, 4, 5 ]

[Killed] BlockStatement
src/resolveLineSelections.ts:109:69
 	return result;
 }
 
-function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {
-	return (
-		parsed.selections.length === 0 ||
-		parsed.selections.every((s) => s.isExclusion)
-	);
-}
+function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {}
 
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected '' to deeply equal 'line1\nline5'

[Killed] EqualityOperator
src/resolveLineSelections.ts:111:3
 
 function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {
 	return (
-		parsed.selections.length === 0 ||
+		parsed.selections.length !== 0 ||
 		parsed.selections.every((s) => s.isExclusion)
 	);
killedBy: It should apply single line selection
statusReason: expected 'line1\nline2\nline3\nline4\nline5' to deeply equal 'line3'

[Killed] ConditionalExpression
src/resolveLineSelections.ts:111:3
 
 function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {
 	return (
-		parsed.selections.length === 0 ||
-		parsed.selections.every((s) => s.isExclusion)
+		false
 	);
 }
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected '' to deeply equal 'line1\nline5'

[Killed] ArrowFunction
src/resolveLineSelections.ts:112:27
 function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {
 	return (
 		parsed.selections.length === 0 ||
-		parsed.selections.every((s) => s.isExclusion)
+		parsed.selections.every(() => undefined)
 	);
 }
killedBy: It should handle only exclusions (include all then exclude)
statusReason: expected '' to deeply equal 'line1\nline5'

[Killed] MethodExpression
src/resolveLineSelections.ts:112:3
 function shouldIncludeAllLines(parsed: ParsedLineSelector): boolean {
 	return (
 		parsed.selections.length === 0 ||
-		parsed.selections.every((s) => s.isExclusion)
+		parsed.selections.some(s => s.isExclusion)
 	);
 }
killedBy: It should handle complex mixed positive and negative selections
statusReason: expected 'line1\nline3\nline4\nline5\nline6\nli…' to deeply equal 'line1\nline3\nline5\nline6\nline7\nli…'
