[Killed] BlockStatement
src/capitalize.ts:6:49
  * @param str - The string to capitalize
  * @returns The string with the first letter capitalized
  */
-export function capitalize(str: string): string {
-	return str.charAt(0).toUpperCase() + str.slice(1);
-}
+export function capitalize(str: string): string {}
 
killedBy: Should throw error on zero line number
statusReason: expected [Function] to throw error including 'Line number must be positive or negat…' but got 'undefined must be positive or negativ…'

[Killed] MethodExpression
src/capitalize.ts:7:9
  * @returns The string with the first letter capitalized
  */
 export function capitalize(str: string): string {
-	return str.charAt(0).toUpperCase() + str.slice(1);
+	return str.charAt(0).toLowerCase() + str.slice(1);
 }
 
killedBy: Should throw error on zero line number
statusReason: expected [Function] to throw error including 'Line number must be positive or negat…' but got 'line number must be positive or negat…'

[Killed] MethodExpression
src/capitalize.ts:7:39
  * @returns The string with the first letter capitalized
  */
 export function capitalize(str: string): string {
-	return str.charAt(0).toUpperCase() + str.slice(1);
+	return str.charAt(0).toUpperCase() + str;
 }
 
killedBy: Should throw error on zero line number
statusReason: expected [Function] to throw error including 'Line number must be positive or negat…' but got 'Lline number must be positive or nega…'
