[Survived] MethodExpression
src/parseLineSelector.ts:9:18
 	lineSelectorString: string,
 ): ParsedLineSelector {
 	// Handle empty or whitespace-only selectors
-	const trimmed = lineSelectorString.trim();
+	const trimmed = lineSelectorString;
 	if (!trimmed || trimmed === ":") {
 		return { selections: [], hasNegativeIndexing: false, hasExclusions: false };

[Killed] EqualityOperator
src/parseLineSelector.ts:10:18
 ): ParsedLineSelector {
 	// Handle empty or whitespace-only selectors
 	const trimmed = lineSelectorString.trim();
-	if (!trimmed || trimmed === ":") {
+	if (!trimmed || trimmed !== ":") {
 		return { selections: [], hasNegativeIndexing: false, hasExclusions: false };
 	}
killedBy: Should parse single line
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/parseLineSelector.ts:10:35
 ): ParsedLineSelector {
 	// Handle empty or whitespace-only selectors
 	const trimmed = lineSelectorString.trim();
-	if (!trimmed || trimmed === ":") {
-		return { selections: [], hasNegativeIndexing: false, hasExclusions: false };
-	}
+	if (!trimmed || trimmed === ":") {}
 
 	// v3.0.0: Only support new bracket syntax with colons
killedBy: Should handle colon-only selector
statusReason: expected [ { type: 'range', …(3) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/parseLineSelector.ts:11:49
 	// Handle empty or whitespace-only selectors
 	const trimmed = lineSelectorString.trim();
 	if (!trimmed || trimmed === ":") {
-		return { selections: [], hasNegativeIndexing: false, hasExclusions: false };
+		return { selections: [], hasNegativeIndexing: true, hasExclusions: false };
 	}
 
killedBy: Should handle empty selector
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parseLineSelector.ts:11:71
 	// Handle empty or whitespace-only selectors
 	const trimmed = lineSelectorString.trim();
 	if (!trimmed || trimmed === ":") {
-		return { selections: [], hasNegativeIndexing: false, hasExclusions: false };
+		return { selections: [], hasNegativeIndexing: false, hasExclusions: true };
 	}
 
killedBy: Should handle empty selector
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/parseLineSelector.ts:16:6
 
 	// v3.0.0: Only support new bracket syntax with colons
 	// Old dash syntax is no longer supported
-	if (hasOldDashSyntax(trimmed)) {
+	if (false) {
 		throw new Error(
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/parseLineSelector.ts:16:6
 
 	// v3.0.0: Only support new bracket syntax with colons
 	// Old dash syntax is no longer supported
-	if (hasOldDashSyntax(trimmed)) {
+	if (true) {
 		throw new Error(
killedBy: Should parse single line
statusReason: BREAKING CHANGE: The dash syntax '5' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] BlockStatement
src/parseLineSelector.ts:25:54
 	return parseSelections(trimmed);
 }
 
-function hasOldDashSyntax(selector: string): boolean {
-	return selector
-		.split(",")
-		.map((part) => part.trim())
-		.some((part) => {
-			// Skip exclusions for this check
-			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
-
-			// If it contains a colon, it's new syntax
-			if (cleanPart.includes(":")) return false;
-
-			// Check for dash patterns that are NOT single negative numbers
-			if (cleanPart.includes("-")) {
-				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
-				// Dash range like "2-4" is old syntax
-				return true;
-			}
-
-			return false;
-		});
-}
+function hasOldDashSyntax(selector: string): boolean {}
 
 function parseSelections(selector: string): ParsedLineSelector {
killedBy: it should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/parseLineSelector.ts:26:9
 }
 
 function hasOldDashSyntax(selector: string): boolean {
-	return selector
-		.split(",")
-		.map((part) => part.trim())
-		.some((part) => {
-			// Skip exclusions for this check
-			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
-
-			// If it contains a colon, it's new syntax
-			if (cleanPart.includes(":")) return false;
-
-			// Check for dash patterns that are NOT single negative numbers
-			if (cleanPart.includes("-")) {
-				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
-				// Dash range like "2-4" is old syntax
-				return true;
-			}
-
-			return false;
-		});
+	return selector.split(",").map(part => part.trim()).every(part => {
+  // Skip exclusions for this check
+  const cleanPart = part.startsWith("!") ? part.slice(1) : part;
+
+  // If it contains a colon, it's new syntax
+  if (cleanPart.includes(":")) return false;
+
+  // Check for dash patterns that are NOT single negative numbers
+  if (cleanPart.includes("-")) {
+    // Single negative number is valid: -5
+    if (/^-\d+$/.test(cleanPart)) return false;
+    // Dash range like "2-4" is old syntax
+    return true;
+  }
+  return false;
+});
 }
 
killedBy: Should throw error on old dash syntax with multiple selections
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/parseLineSelector.ts:28:8
 function hasOldDashSyntax(selector: string): boolean {
 	return selector
 		.split(",")
-		.map((part) => part.trim())
+		.map(() => undefined)
 		.some((part) => {
 			// Skip exclusions for this check
killedBy: Should parse single line
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] MethodExpression
src/parseLineSelector.ts:28:18
 function hasOldDashSyntax(selector: string): boolean {
 	return selector
 		.split(",")
-		.map((part) => part.trim())
+		.map((part) => part)
 		.some((part) => {
 			// Skip exclusions for this check

[Killed] BlockStatement
src/parseLineSelector.ts:29:19
 	return selector
 		.split(",")
 		.map((part) => part.trim())
-		.some((part) => {
-			// Skip exclusions for this check
-			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
-
-			// If it contains a colon, it's new syntax
-			if (cleanPart.includes(":")) return false;
-
-			// Check for dash patterns that are NOT single negative numbers
-			if (cleanPart.includes("-")) {
-				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
-				// Dash range like "2-4" is old syntax
-				return true;
-			}
-
-			return false;
-		});
+		.some((part) => {});
 }
 
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/parseLineSelector.ts:31:45
 		.map((part) => part.trim())
 		.some((part) => {
 			// Skip exclusions for this check
-			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
+			const cleanPart = part.startsWith("!") ? part : part;
 
 			// If it contains a colon, it's new syntax
killedBy: Should parse negative single line exclusion
statusReason: BREAKING CHANGE: The dash syntax '!-3' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] MethodExpression
src/parseLineSelector.ts:31:22
 		.map((part) => part.trim())
 		.some((part) => {
 			// Skip exclusions for this check
-			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
+			const cleanPart = part.endsWith("!") ? part.slice(1) : part;
 
 			// If it contains a colon, it's new syntax
killedBy: Should parse negative single line exclusion
statusReason: BREAKING CHANGE: The dash syntax '!-3' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] BooleanLiteral
src/parseLineSelector.ts:34:40
 			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
 
 			// If it contains a colon, it's new syntax
-			if (cleanPart.includes(":")) return false;
+			if (cleanPart.includes(":")) return true;
 
 			// Check for dash patterns that are NOT single negative numbers
killedBy: Should parse open-ended range from start
statusReason: BREAKING CHANGE: The dash syntax '5:' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] ConditionalExpression
src/parseLineSelector.ts:34:8
 			const cleanPart = part.startsWith("!") ? part.slice(1) : part;
 
 			// If it contains a colon, it's new syntax
-			if (cleanPart.includes(":")) return false;
+			if (false) return false;
 
 			// Check for dash patterns that are NOT single negative numbers
killedBy: Should parse negative range
statusReason: BREAKING CHANGE: The dash syntax '-10:-5' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] ConditionalExpression
src/parseLineSelector.ts:37:8
 			if (cleanPart.includes(":")) return false;
 
 			// Check for dash patterns that are NOT single negative numbers
-			if (cleanPart.includes("-")) {
+			if (false) {
 				// Single negative number is valid: -5
 				if (/^-\d+$/.test(cleanPart)) return false;
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/parseLineSelector.ts:37:33
 			if (cleanPart.includes(":")) return false;
 
 			// Check for dash patterns that are NOT single negative numbers
-			if (cleanPart.includes("-")) {
-				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
-				// Dash range like "2-4" is old syntax
-				return true;
-			}
+			if (cleanPart.includes("-")) {}
 
 			return false;
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/parseLineSelector.ts:39:9
 			// Check for dash patterns that are NOT single negative numbers
 			if (cleanPart.includes("-")) {
 				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
+				if (false) return false;
 				// Dash range like "2-4" is old syntax
 				return true;
killedBy: it should parse tag with file path and negative single line
statusReason: BREAKING CHANGE: The dash syntax '-3' inside brackets is no longer supported in v3.0.0+. Please use colon syntax instead. Examples: '2-4' → '2:4', '5-7,11' → '5:7,11'. See documentation for the new bracket syntax.

[Killed] ConditionalExpression
src/parseLineSelector.ts:39:9
 			// Check for dash patterns that are NOT single negative numbers
 			if (cleanPart.includes("-")) {
 				// Single negative number is valid: -5
-				if (/^-\d+$/.test(cleanPart)) return false;
+				if (true) return false;
 				// Dash range like "2-4" is old syntax
 				return true;
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/parseLineSelector.ts:41:12
 				// Single negative number is valid: -5
 				if (/^-\d+$/.test(cleanPart)) return false;
 				// Dash range like "2-4" is old syntax
-				return true;
+				return false;
 			}
 
killedBy: Should throw error on old dash syntax
statusReason: expected [Function] to throw an error

[Killed] ArrayDeclaration
src/parseLineSelector.ts:49:38
 }
 
 function parseSelections(selector: string): ParsedLineSelector {
-	const selections: LineSelection[] = [];
+	const selections: LineSelection[] = ["Stryker was here"];
 	let hasNegativeIndexing = false;
 	let hasExclusions = false;
killedBy: Should parse single line
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Survived] BooleanLiteral
src/parseLineSelector.ts:50:28
 
 function parseSelections(selector: string): ParsedLineSelector {
 	const selections: LineSelection[] = [];
-	let hasNegativeIndexing = false;
+	let hasNegativeIndexing = true;
 	let hasExclusions = false;
 

[Survived] BooleanLiteral
src/parseLineSelector.ts:51:22
 function parseSelections(selector: string): ParsedLineSelector {
 	const selections: LineSelection[] = [];
 	let hasNegativeIndexing = false;
-	let hasExclusions = false;
+	let hasExclusions = true;
 
 	// Split by comma and parse each part

[Killed] ArrowFunction
src/parseLineSelector.ts:54:40
 	let hasExclusions = false;
 
 	// Split by comma and parse each part
-	const parts = selector.split(",").map((part) => part.trim());
+	const parts = selector.split(",").map(() => undefined);
 
 	for (const part of parts) {
killedBy: Should parse single line
statusReason: expected [] to have a length of 1 but got +0

[Survived] MethodExpression
src/parseLineSelector.ts:54:50
 	let hasExclusions = false;
 
 	// Split by comma and parse each part
-	const parts = selector.split(",").map((part) => part.trim());
+	const parts = selector.split(",").map((part) => part);
 
 	for (const part of parts) {

[Killed] ConditionalExpression
src/parseLineSelector.ts:57:7
 	const parts = selector.split(",").map((part) => part.trim());
 
 	for (const part of parts) {
-		if (!part) continue;
+		if (true) continue;
 
 		// Handle exclusion syntax
killedBy: Should parse single line
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/parseLineSelector.ts:57:7
 	const parts = selector.split(",").map((part) => part.trim());
 
 	for (const part of parts) {
-		if (!part) continue;
+		if (part) continue;
 
 		// Handle exclusion syntax
killedBy: Should parse single line
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/parseLineSelector.ts:60:23
 		if (!part) continue;
 
 		// Handle exclusion syntax
-		const isExclusion = part.startsWith("!");
+		const isExclusion = part.endsWith("!");
 		const cleanPart = isExclusion ? part.slice(1) : part;
 
killedBy: Should parse single line exclusion
statusReason: Invalid line number: !5

[Killed] StringLiteral
src/parseLineSelector.ts:60:39
 		if (!part) continue;
 
 		// Handle exclusion syntax
-		const isExclusion = part.startsWith("!");
+		const isExclusion = part.startsWith("");
 		const cleanPart = isExclusion ? part.slice(1) : part;
 
killedBy: Should parse single line
statusReason: Invalid line number:

[Killed] MethodExpression
src/parseLineSelector.ts:61:35
 
 		// Handle exclusion syntax
 		const isExclusion = part.startsWith("!");
-		const cleanPart = isExclusion ? part.slice(1) : part;
+		const cleanPart = isExclusion ? part : part;
 
 		if (isExclusion) {
killedBy: Should parse single line exclusion
statusReason: Invalid line number: !5

[Killed] ConditionalExpression
src/parseLineSelector.ts:63:7
 		const isExclusion = part.startsWith("!");
 		const cleanPart = isExclusion ? part.slice(1) : part;
 
-		if (isExclusion) {
+		if (false) {
 			hasExclusions = true;
 		}
killedBy: Should parse single line exclusion
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/parseLineSelector.ts:63:20
 		const isExclusion = part.startsWith("!");
 		const cleanPart = isExclusion ? part.slice(1) : part;
 
-		if (isExclusion) {
-			hasExclusions = true;
-		}
+		if (isExclusion) {}
 
 		// Parse the selection
killedBy: Should parse single line exclusion
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parseLineSelector.ts:64:20
 		const cleanPart = isExclusion ? part.slice(1) : part;
 
 		if (isExclusion) {
-			hasExclusions = true;
+			hasExclusions = false;
 		}
 
killedBy: Should parse single line exclusion
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parseLineSelector.ts:71:38
 		const selection = parseSelection(cleanPart, isExclusion);
 
 		// Check if this selection uses negative indexing
-		if (selection.type === "single" && selection.line < 0) {
+		if (selection.type === "single" && selection.line >= 0) {
 			hasNegativeIndexing = true;
 		} else if (
killedBy: Should parse negative single line
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parseLineSelector.ts:71:7
 		const selection = parseSelection(cleanPart, isExclusion);
 
 		// Check if this selection uses negative indexing
-		if (selection.type === "single" && selection.line < 0) {
+		if (false) {
 			hasNegativeIndexing = true;
 		} else if (
killedBy: Should parse negative single line
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parseLineSelector.ts:72:26
 
 		// Check if this selection uses negative indexing
 		if (selection.type === "single" && selection.line < 0) {
-			hasNegativeIndexing = true;
+			hasNegativeIndexing = false;
 		} else if (
 			selection.type === "range" &&
killedBy: Should parse negative single line
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parseLineSelector.ts:74:4
 		if (selection.type === "single" && selection.line < 0) {
 			hasNegativeIndexing = true;
 		} else if (
-			selection.type === "range" &&
-			((selection.start !== undefined && selection.start < 0) ||
-				(selection.end !== undefined && selection.end < 0))
+			false
 		) {
 			hasNegativeIndexing = true;
killedBy: Should parse negative range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parseLineSelector.ts:74:4
 		if (selection.type === "single" && selection.line < 0) {
 			hasNegativeIndexing = true;
 		} else if (
-			selection.type === "range" &&
+			selection.type !== "range" &&
 			((selection.start !== undefined && selection.start < 0) ||
 				(selection.end !== undefined && selection.end < 0))
killedBy: Should parse negative range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parseLineSelector.ts:75:6
 			hasNegativeIndexing = true;
 		} else if (
 			selection.type === "range" &&
-			((selection.start !== undefined && selection.start < 0) ||
+			((selection.start === undefined && selection.start < 0) ||
 				(selection.end !== undefined && selection.end < 0))
 		) {
killedBy: Should parse negative open-ended range
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/parseLineSelector.ts:75:5
 			hasNegativeIndexing = true;
 		} else if (
 			selection.type === "range" &&
-			((selection.start !== undefined && selection.start < 0) ||
-				(selection.end !== undefined && selection.end < 0))
+			(selection.start !== undefined && selection.start < 0 && selection.end !== undefined && selection.end < 0)
 		) {
 			hasNegativeIndexing = true;
killedBy: Should parse negative open-ended range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parseLineSelector.ts:76:37
 		} else if (
 			selection.type === "range" &&
 			((selection.start !== undefined && selection.start < 0) ||
-				(selection.end !== undefined && selection.end < 0))
+				(selection.end !== undefined && selection.end >= 0))
 		) {
 			hasNegativeIndexing = true;
killedBy: it should parse mixed positive/negative ranges
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parseLineSelector.ts:76:6
 		} else if (
 			selection.type === "range" &&
 			((selection.start !== undefined && selection.start < 0) ||
-				(selection.end !== undefined && selection.end < 0))
+				(selection.end === undefined && selection.end < 0))
 		) {
 			hasNegativeIndexing = true;
killedBy: Should parse open-ended range to negative end
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/parseLineSelector.ts:77:5
 			selection.type === "range" &&
 			((selection.start !== undefined && selection.start < 0) ||
 				(selection.end !== undefined && selection.end < 0))
-		) {
-			hasNegativeIndexing = true;
-		}
+		) {}
 
 		selections.push(selection);
killedBy: Should parse negative range
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parseLineSelector.ts:78:26
 			((selection.start !== undefined && selection.start < 0) ||
 				(selection.end !== undefined && selection.end < 0))
 		) {
-			hasNegativeIndexing = true;
+			hasNegativeIndexing = false;
 		}
 
killedBy: Should parse negative range
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/parseLineSelector.ts:87:66
 	return { selections, hasNegativeIndexing, hasExclusions };
 }
 
-function parseLineNumber(value: string, context: string): number {
-	const num = Number.parseInt(value);
-	if (!Number.isFinite(num)) {
-		throw new Error(`Invalid ${context}: ${value}`);
-	}
-	if (num === 0) {
-		throw new Error(
-			`${capitalize(context)} must be positive or negative, not zero`,
-		);
-	}
-	return num;
-}
+function parseLineNumber(value: string, context: string): number {}
 
 function parseSelection(part: string, isExclusion: boolean): LineSelection {
killedBy: it should parse tag with file path and single line
statusReason: expected { type: 'single', …(2) } to deeply equal { type: 'single', …(2) }

[Killed] ConditionalExpression
src/parseLineSelector.ts:89:6
 
 function parseLineNumber(value: string, context: string): number {
 	const num = Number.parseInt(value);
-	if (!Number.isFinite(num)) {
+	if (true) {
 		throw new Error(`Invalid ${context}: ${value}`);
 	}
killedBy: Should parse single line
statusReason: Invalid line number: 5

[Killed] ConditionalExpression
src/parseLineSelector.ts:89:6
 
 function parseLineNumber(value: string, context: string): number {
 	const num = Number.parseInt(value);
-	if (!Number.isFinite(num)) {
+	if (false) {
 		throw new Error(`Invalid ${context}: ${value}`);
 	}
killedBy: Should throw error on invalid line number
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/parseLineSelector.ts:92:6
 	if (!Number.isFinite(num)) {
 		throw new Error(`Invalid ${context}: ${value}`);
 	}
-	if (num === 0) {
+	if (false) {
 		throw new Error(
 			`${capitalize(context)} must be positive or negative, not zero`,
killedBy: it should throw error on zero line number
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/parseLineSelector.ts:92:17
 	if (!Number.isFinite(num)) {
 		throw new Error(`Invalid ${context}: ${value}`);
 	}
-	if (num === 0) {
-		throw new Error(
-			`${capitalize(context)} must be positive or negative, not zero`,
-		);
-	}
+	if (num === 0) {}
 	return num;
 }
killedBy: Should throw error on zero line number
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/parseLineSelector.ts:102:27
 
 function parseSelection(part: string, isExclusion: boolean): LineSelection {
 	// Handle single line (positive or negative)
-	if (!part.includes(":")) {
-		const num = parseLineNumber(part, "line number");
-		return {
-			type: "single",
-			isExclusion,
-			line: num,
-		};
-	}
+	if (!part.includes(":")) {}
 
 	// Handle range syntax (start:end, start:, :end, :)
killedBy: it should parse tag with file path and single line
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'single', …(2) }

[Killed] ConditionalExpression
src/parseLineSelector.ts:102:6
 
 function parseSelection(part: string, isExclusion: boolean): LineSelection {
 	// Handle single line (positive or negative)
-	if (!part.includes(":")) {
+	if (false) {
 		const num = parseLineNumber(part, "line number");
 		return {
killedBy: Should parse single line
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'single', …(2) }

[Killed] ObjectLiteral
src/parseLineSelector.ts:104:10
 	// Handle single line (positive or negative)
 	if (!part.includes(":")) {
 		const num = parseLineNumber(part, "line number");
-		return {
-			type: "single",
-			isExclusion,
-			line: num,
-		};
+		return {};
 	}
 
killedBy: Should parse single line
statusReason: expected {} to deeply equal { type: 'single', …(2) }

[Killed] MethodExpression
src/parseLineSelector.ts:113:19
 
 	// Handle range syntax (start:end, start:, :end, :)
 	const colonIndex = part.indexOf(":");
-	const startStr = part.slice(0, colonIndex);
+	const startStr = part;
 	const endStr = part.slice(colonIndex + 1);
 
killedBy: Should parse open-ended range to end
statusReason: Invalid range start: :10

[Killed] MethodExpression
src/parseLineSelector.ts:114:17
 	// Handle range syntax (start:end, start:, :end, :)
 	const colonIndex = part.indexOf(":");
 	const startStr = part.slice(0, colonIndex);
-	const endStr = part.slice(colonIndex + 1);
+	const endStr = part;
 
 	let start: number | undefined;
killedBy: Should parse open-ended range from start
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'range', …(3) }

[Killed] ArithmeticOperator
src/parseLineSelector.ts:114:28
 	// Handle range syntax (start:end, start:, :end, :)
 	const colonIndex = part.indexOf(":");
 	const startStr = part.slice(0, colonIndex);
-	const endStr = part.slice(colonIndex + 1);
+	const endStr = part.slice(colonIndex - 1);
 
 	let start: number | undefined;
killedBy: Should parse open-ended range from start
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'range', …(3) }

[Killed] ConditionalExpression
src/parseLineSelector.ts:120:6
 	let end: number | undefined;
 
 	// Parse start
-	if (startStr) {
+	if (false) {
 		start = parseLineNumber(startStr, "range start");
 	}
killedBy: Should parse open-ended range from start
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'range', …(3) }

[Killed] ConditionalExpression
src/parseLineSelector.ts:120:6
 	let end: number | undefined;
 
 	// Parse start
-	if (startStr) {
+	if (true) {
 		start = parseLineNumber(startStr, "range start");
 	}
killedBy: it should handle absolute paths with brackets
statusReason: Invalid range start:

[Killed] StringLiteral
src/parseLineSelector.ts:121:37
 
 	// Parse start
 	if (startStr) {
-		start = parseLineNumber(startStr, "range start");
+		start = parseLineNumber(startStr, "");
 	}
 
killedBy: Should throw error on zero range start
statusReason: expected [Function] to throw error including 'Range start must be positive or negat…' but got ' must be positive or negative, not ze…'

[Killed] ConditionalExpression
src/parseLineSelector.ts:125:6
 	}
 
 	// Parse end
-	if (endStr) {
+	if (true) {
 		end = parseLineNumber(endStr, "range end");
 	}
killedBy: it should parse open-ended ranges
statusReason: Invalid range end:

[Killed] ConditionalExpression
src/parseLineSelector.ts:125:6
 	}
 
 	// Parse end
-	if (endStr) {
+	if (false) {
 		end = parseLineNumber(endStr, "range end");
 	}
killedBy: Should parse open-ended range to end
statusReason: expected { type: 'range', …(3) } to deeply equal { type: 'range', …(3) }

[Killed] LogicalOperator
src/parseLineSelector.ts:131:3
 
 	// Validate forward range logic for same-sign ranges only
 	if (
-		start !== undefined &&
-		end !== undefined &&
-		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
-		start > end
+		start !== undefined && end !== undefined && (start > 0 && end > 0 || start < 0 && end < 0) || start > end
 	) {
 		throw new Error(
killedBy: Should parse closed range
statusReason: Range start (2) must be less than or equal to range end (8)

[Killed] ConditionalExpression
src/parseLineSelector.ts:131:3
 
 	// Validate forward range logic for same-sign ranges only
 	if (
-		start !== undefined &&
-		end !== undefined &&
-		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
-		start > end
+		true
 	) {
 		throw new Error(
killedBy: it should parse bracket syntax with colon ranges
statusReason: Range start (2) must be less than or equal to range end (8)

[Killed] EqualityOperator
src/parseLineSelector.ts:132:3
 	// Validate forward range logic for same-sign ranges only
 	if (
 		start !== undefined &&
-		end !== undefined &&
+		end === undefined &&
 		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
 		start > end
killedBy: Should throw error on positive range with start > end
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
src/parseLineSelector.ts:132:3
 	// Validate forward range logic for same-sign ranges only
 	if (
 		start !== undefined &&
-		end !== undefined &&
+		true &&
 		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
 		start > end

[Killed] ConditionalExpression
src/parseLineSelector.ts:133:18
 	if (
 		start !== undefined &&
 		end !== undefined &&
-		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
+		((start > 0 && true) || (start < 0 && end < 0)) &&
 		start > end
 	) {
killedBy: Should parse mixed positive start to negative end
statusReason: Range start (2) must be less than or equal to range end (-5)

[Killed] EqualityOperator
src/parseLineSelector.ts:133:31
 	if (
 		start !== undefined &&
 		end !== undefined &&
-		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
+		((start > 0 && end > 0) || (start >= 0 && end < 0)) &&
 		start > end
 	) {
killedBy: It should apply mixed positive to negative range
statusReason: Range start (3) must be less than or equal to range end (-3)

[Killed] ConditionalExpression
src/parseLineSelector.ts:134:3
 		start !== undefined &&
 		end !== undefined &&
 		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
-		start > end
+		true
 	) {
 		throw new Error(
killedBy: It should apply range selection
statusReason: Range start (2) must be less than or equal to range end (4)
