[Killed] EqualityOperator
src/parseLineSelector.ts:134:3
 		start !== undefined &&
 		end !== undefined &&
 		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
-		start > end
+		start <= end
 	) {
 		throw new Error(
killedBy: it should parse bracket syntax with colon ranges
statusReason: Range start (2) must be less than or equal to range end (8)

[Killed] BlockStatement
src/parseLineSelector.ts:135:4
 		end !== undefined &&
 		((start > 0 && end > 0) || (start < 0 && end < 0)) &&
 		start > end
-	) {
-		throw new Error(
-			`Range start (${start}) must be less than or equal to range end (${end})`,
-		);
-	}
+	) {}
 
 	return {
killedBy: Should throw error on positive range with start > end
statusReason: expected [Function] to throw an error
